{
  "meeting": {
    "participants": [
      "Andrei (Backend Developer)",
      "Mihai (Frontend Developer)"
    ],
    "duration": "10 minutes",
    "transcript": [
      {
        "speaker": "Andrei",
        "message": "Salut, Mihai! Ai două minute să discutăm despre integrarea pentru noul endpoint?"
      },
      {
        "speaker": "Mihai",
        "message": "Salut! Da, sigur, spune."
      },
      {
        "speaker": "Andrei",
        "message": "Am finalizat endpoint-ul pentru `/reports/summary`. Returnează JSON cu toate câmpurile de care ai nevoie. L-ai apucat să-l testezi în Postman?"
      },
      {
        "speaker": "Mihai",
        "message": "M-am uitat puțin ieri, dar răspunsul avea două câmpuri în plus – `internalId` și `debugInfo`. Pe frontend nu avem ce face cu ele."
      },
      {
        "speaker": "Andrei",
        "message": "Da, corect. Le-am lăsat acolo temporar pentru debugging. Pot să le scot acum. Le scoatem complet sau vrei să le pun sub un flag `?debug=true`?"
      },
      {
        "speaker": "Mihai",
        "message": "Cred că mai bine le scoatem complet. Dacă mai ai nevoie de ele, folosim log-urile."
      },
      {
        "speaker": "Andrei",
        "message": "Perfect, le elimin. În rest, structura JSON e ok? Ai tot ce îți trebuie pentru dashboard?"
      },
      {
        "speaker": "Mihai",
        "message": "Da, doar că ar fi util dacă ai putea adăuga și `lastUpdatedAt`. Avem secțiunea aia de „Ultima actualizare” pe care vrem s-o completăm din backend."
      },
      {
        "speaker": "Andrei",
        "message": "Nicio problemă. Îl adaug într-o oră și împing un commit."
      },
      {
        "speaker": "Mihai",
        "message": "Super. Apropo, endpoint-ul răspunde cam lent – între 900 ms și 1.2 secunde la mine."
      },
      {
        "speaker": "Andrei",
        "message": "Știu. Am de optimizat query-ul de agregare. E cam heavy. Lucrez la el azi, ar trebui să-l reduc sub 400 ms."
      },
      {
        "speaker": "Mihai",
        "message": "Ok, nu e un blocker, doar te-am anunțat."
      },
      {
        "speaker": "Andrei",
        "message": "Mersi. Tu cum stai cu componenta de UI?"
      },
      {
        "speaker": "Mihai",
        "message": "Aproape gata. Mai fac partea de sortare și pun styling-ul final. Dacă finalizezi `lastUpdatedAt`, fac integrarea azi."
      },
      {
        "speaker": "Andrei",
        "message": "Perfect. Hai că împing actualizările până la prânz."
      },
      {
        "speaker": "Mihai",
        "message": "Bine, merci! Ping dacă e ceva."
      },
      {
        "speaker": "Andrei",
        "message": "Sigur. O zi bună!"
      }
    ]
  }
}
